### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [574]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv("purchase_data.csv")
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [575]:
purchase_data_df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [576]:
purchase_data_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

## Player Count

In [650]:
player = purchase_data_df["SN"].value_counts()
player_count_unique = player.count()
player_count_unique

576

In [651]:
player_count = pd.DataFrame({"Total Number of Players": [player_count_unique]})
player_count

   Total Number of Players
0                      576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [654]:
items = purchase_data_df["Item Name"].unique()

In [655]:
items_count = len(items)
items_count

179

In [579]:
price = purchase_data_df["Price"].mean()
price

3.050987179487176

In [580]:
purchases = purchase_data_df["Purchase ID"].count()
purchases

780

In [664]:
revenue = purchase_data_df["Price"].sum()
revenue

2379.77

In [665]:
purchasing_analysis_df = pd.DataFrame({"Number of Unique Items": [items_count],
                                   "Average Price": [price],
                                   "Number of Purchases": [purchases],
                                   "Total Revenue": [revenue]})

#pd.options.display.float_format = '${:,.2f}'.format
purchasing_analysis_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179          $3.05                  780      $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [583]:
drop_equal_df = purchase_data_df.drop_duplicates(['SN'], keep='last')
drop_equal_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18

In [584]:
# female dataframe
female_df = drop_equal_df.loc[drop_equal_df["Gender"] == "Female", :]
female_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
66,66,Chanastsda67,21,Female,6,Rusty Skull,3.70
76,76,Mindadaran26,13,Female,88,"Emberling, Defender of Delusions",3.75

In [585]:
female_count = female_df["SN"]
female_len = len(female_count)
female_len

81

In [586]:
# Male dataframe
male_df = drop_equal_df.loc[drop_equal_df["Gender"] == "Male", :]
male_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18

In [587]:
male_count = male_df["SN"]
male_len = len(male_count)
male_len

484

In [588]:
# Other / Non-Disclosed dataframe
other_df = drop_equal_df.loc[drop_equal_df["Gender"] == "Other / Non-Disclosed", :]
other_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39
242,242,Eodaisu60,16,Other / Non-Disclosed,39,"Betrayal, Whisper of Grieving Widows",3.94
291,291,Idairin51,20,Other / Non-Disclosed,35,Heartless Bone Dualblade,3.45

In [589]:
other_count = other_df["SN"]
other_len = len(other_count)
other_len

11

In [590]:
total_gender = female_len + male_len + other_len
total_gender

576

In [591]:
female_percentage = (female_len/total_gender)*100
female_percentage

14.0625

In [592]:
male_percentage = (male_len/total_gender)*100
male_percentage

84.02777777777779

In [593]:
other_percentage = (other_len/total_gender)*100
other_percentage

1.9097222222222223

In [594]:
gender_dem = {'Gender':["Male", "Female", "Other / Non-Disclosed"],
            'Total Count':[male_len, female_len, other_len],
            'Percentage of Players':[male_percentage, female_percentage, other_percentage]}
gender_dem

{'Gender': ['Male', 'Female', 'Other / Non-Disclosed'],
 'Total Count': [484, 81, 11],
 'Percentage of Players': [84.02777777777779, 14.0625, 1.9097222222222223]}

In [662]:
gender_dem_df = pd.DataFrame(gender_dem)
gender_dem_df

                  Gender  Total Count  Percentage of Players
0                   Male          484                 $84.03
1                 Female           81                 $14.06
2  Other / Non-Disclosed           11                  $1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [596]:
gender_purchase = purchase_data_df.groupby(['Gender'])
gender_purchase_df = pd.DataFrame(gender_purchase['Gender'].count())
gender_purchase_df = gender_purchase_df.rename(columns={'Gender':'Purchase Count'})
gender_purchase_df

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [597]:
price_purchase = purchase_data_df.groupby(['Gender'])
price_purchase_df = pd.DataFrame(price_purchase['Price'].mean())
#pd.options.display.float_format = '${:,.2f}'.format
price_purchase_df = price_purchase_df.rename(columns={'Price':'Average Purchase Price'})
price_purchase_df

                       Average Purchase Price
Gender
Female                               3.203009
Male                                 3.017853
Other / Non-Disclosed                3.346000

In [598]:
total_purchase_value = purchase_data_df.groupby(['Gender'])
total_purchase_value_df = pd.DataFrame(price_purchase['Price'].sum())
#pd.options.display.float_format = '${:,.2f}'.format
total_purchase_value_df = total_purchase_value_df.rename(columns={'Price':'Total Purchase Value'})
total_purchase_value_df

                       Total Purchase Value
Gender
Female                               361.94
Male                                1967.64
Other / Non-Disclosed                 50.19

In [599]:
#Avg Total Purchase per Person
price_female = total_purchase_value_df['Total Purchase Value'].values[0]
price_female1 = gender_dem_df['Total Count'].values[1]
avg_price_female = (price_female / price_female1)
avg_price_female

4.4683950617283905

In [600]:
price_male = total_purchase_value_df['Total Purchase Value'].values[1]
price_male1 = gender_dem_df['Total Count'].values[0]
avg_price_male = (price_male / price_male1)
avg_price_male

4.065371900826445

In [601]:
price_other = total_purchase_value_df['Total Purchase Value'].values[2]
price_other1 = gender_dem_df['Total Count'].values[2]
avg_price_other = (price_other / price_other1)
avg_price_other

4.562727272727273

In [602]:
avg_total_person_df = pd.DataFrame({'Gender':["Female", "Male", "Other / Non-Disclosed"],
                                'Avg Total Purchase per Person':[avg_price_female, avg_price_male, avg_price_other]})
avg_total_person_df

                  Gender  Avg Total Purchase per Person
0                 Female                       4.468395
1                   Male                       4.065372
2  Other / Non-Disclosed                       4.562727

In [603]:
#Merge table to have count and percentage, together
merged_purchase_gender_df = pd.merge(gender_purchase_df, price_purchase_df, on="Gender")
merged_purchase_gender_df

                       Purchase Count  Average Purchase Price
Gender
Female                            113                3.203009
Male                              652                3.017853
Other / Non-Disclosed              15                3.346000

In [604]:
merged_purchase_gender2_df = pd.merge(merged_purchase_gender_df, merged_purchase_gender_df, on="Gender")
merged_purchase_gender2_df

,Purchase Count_x,Average Purchase Price_x,Purchase Count_y,Average Purchase Price_y
Gender,,,,
Female,113,3.203009,113,3.203009
Male,652,3.017853,652,3.017853
Other / Non-Disclosed,15,3.346000,15,3.346000

In [605]:
merged_purchase_gender2_df = merged_purchase_gender2_df.rename(columns={'Purchase Count_x':'Purchase Count',
                                                                    'Average Purchase Price_x':'Average Purchase Price'
                                                                    })
merged_purchase_gender2_df

,Purchase Count,Average Purchase Price,Purchase Count_y,Average Purchase Price_y
Gender,,,,
Female,113,3.203009,113,3.203009
Male,652,3.017853,652,3.017853
Other / Non-Disclosed,15,3.346000,15,3.346000

In [606]:
merged_purchase_gender2_df = merged_purchase_gender2_df.drop(columns="Average Purchase Price_y")
merged_purchase_gender2_df

,Purchase Count,Average Purchase Price,Purchase Count_y
Gender,,,
Female,113,3.203009,113
Male,652,3.017853,652
Other / Non-Disclosed,15,3.346000,15

In [607]:
merged_purchase_gender_df = pd.merge(merged_purchase_gender2_df, total_purchase_value_df, on="Gender")
merged_purchase_gender_df

,Purchase Count,Average Purchase Price,Purchase Count_y,Total Purchase Value
Gender,,,,
Female,113,3.203009,113,361.94
Male,652,3.017853,652,1967.64
Other / Non-Disclosed,15,3.346000,15,50.19

In [608]:
merged_purchase_gender_final_df = pd.merge(merged_purchase_gender_df, avg_total_person_df, on="Gender")
merged_purchase_gender_final_df

,Gender,Purchase Count,Average Purchase Price,Purchase Count_y,Total Purchase Value,Avg Total Purchase per Person
0,Female,113,3.203009,113,361.94,4.468395
1,Male,652,3.017853,652,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,15,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [609]:
print(purchase_data_df["Age"].max())
print(purchase_data_df["Age"].min())

45
7

In [610]:
# Establish bins for ages
bins = [0, 9, 14, 19, 24, 29, 34, 39, 44]

# Create the names for the bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [670]:
# Slice the data and place it into bins
pd.cut(drop_equal_df['Age'], bins, labels=group_labels).head()

1      40+
2    20-24
3    20-24
4    20-24
6    35-39
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [612]:
purchase_data_df["Age Group"] = pd.cut(drop_equal_df["Age"], bins, labels=group_labels)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,NaN
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [613]:
# Create a GroupBy object based upon "Age Group"
purchase_data_df = purchase_data_df.groupby("Age Group")

# Find how many rows fall into each bin
print(purchase_data_df["SN"].count())

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       11
Name: SN, dtype: int64

In [614]:
purchase_data_df[["SN"]].count()

            SN
Age Group
<10         17
10-14       22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40+         11

In [615]:
# percentage of players

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [616]:
purchase_data_df = pd.read_csv("purchase_data.csv")

In [617]:
# Slice the data and place it into bins
pd.cut(purchase_data_df["Age"], bins, labels=group_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [618]:
purchase_data_df["Age Group"] = pd.cut(purchase_data_df["Age"], bins, labels=group_labels)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [619]:
# Create a GroupBy object based upon "Age Group"
purchase_data_df = purchase_data_df.groupby("Age Group")

# Find how many rows fall into each bin
print(purchase_data_df["Purchase ID"].count())

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       12
Name: Purchase ID, dtype: int64

In [620]:
purchase_data_df[["SN"]].count()

            SN
Age Group
<10         23
10-14       28
15-19      136
20-24      365
25-29      101
30-34       73
35-39       41
40+         12

In [621]:
purchase_data2_df = pd.read_csv("purchase_data.csv")

In [622]:
# Establish bins for ages
bins = [0, 9, 14, 19, 24, 29, 34, 39, 44]

# Create the names for the bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [623]:
purchase_data2_df["Age Group"] = pd.cut(purchase_data2_df["Age"], bins, labels=group_labels)
purchase_data2_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [624]:
# Create a GroupBy object based upon "Age Group"
purchase_data2_df = purchase_data2_df.groupby("Age Group")

# Find how many rows fall into each bin
print(purchase_data2_df["Price"].mean())

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      3.045000
Name: Price, dtype: float64

In [666]:
#purchase_data2_df["Price"].count()
purchase_data2_df[["SN"]].mean()

DataError: No numeric types to aggregate

In [ ]:
price_purchase = purchase_data_df.groupby(['Gender'])
price_purchase_df = pd.DataFrame(price_purchase['Price'].mean())
#pd.options.display.float_format = '${:,.2f}'.format
price_purchase_df = price_purchase_df.rename(columns={'Price':'Average Purchase Price'})
price_purchase_df

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
purchase_data_df = pd.read_csv("purchase_data.csv")
purchase_data_df.head()

In [628]:
top_spenders_count = purchase_data_df.groupby(['SN'])
top_spenders_count_df = pd.DataFrame(top_spenders_count['SN'].count())
top_spenders_count_df = top_spenders_count_df.rename(columns={'SN':'Purchase Count'})
top_spenders_count_df.head()

              Purchase Count
SN
Adairialis76               1
Adastirin33                1
Aeda94                     1
Aela59                     1
Aelaria33                  1

In [629]:
top_spenders_average = purchase_data_df.groupby(['SN'])
top_spenders_average_df = pd.DataFrame(top_spenders_average['Price'].mean())
#pd.options.display.float_format = '${:,.2f}'.format
top_spenders_average_df = top_spenders_average_df.rename(columns={'Price':'Average Purchase Price'})
top_spenders_average_df.head()

              Average Purchase Price
SN
Adairialis76                    2.28
Adastirin33                     4.48
Aeda94                          4.91
Aela59                          4.32
Aelaria33                       1.79

In [630]:
top_spenders_total = purchase_data_df.groupby(['SN'])
top_spenders_total_df = pd.DataFrame(top_spenders_total['Price'].sum())
#pd.options.display.float_format = '${:,.2f}'.format
top_spenders_total_df = top_spenders_total_df.rename(columns={'Price':'Total Purchase Value'})
top_spenders_total_df.head()

              Total Purchase Value
SN
Adairialis76                  2.28
Adastirin33                   4.48
Aeda94                        4.91
Aela59                        4.32
Aelaria33                     1.79

In [631]:
#Merge table to have count and percentage, together
top_spenders_df = pd.merge(top_spenders_count_df, top_spenders_average_df, on="SN")
top_spenders_df.head()

              Purchase Count  Average Purchase Price
SN
Adairialis76               1                    2.28
Adastirin33                1                    4.48
Aeda94                     1                    4.91
Aela59                     1                    4.32
Aelaria33                  1                    1.79

In [632]:
top_spenders_df = pd.merge(top_spenders_df, top_spenders_total_df, on="SN")
top_spenders_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [668]:
test = top_spenders_df.sort_values('Total Purchase Value', ascending=False)
test.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                   $3.79                $18.96
Idastidru52               4                   $3.86                $15.45
Chamjask73                3                   $4.61                $13.83
Iral74                    4                   $3.40                $13.62
Iskadarya95               3                   $4.37                $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [626]:
purchase_data_df = pd.read_csv("purchase_data.csv")
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [641]:
item_id = purchase_data_df["Item ID"].value_counts()
item_id.head()

178    12
82      9
108     9
145     9
92      8
Name: Item ID, dtype: int64

In [635]:
most_popular_count = purchase_data_df.groupby(['Item ID'])
most_popular_count_df = pd.DataFrame(most_popular_count['Item ID'].count())
most_popular_count_df = most_popular_count_df.rename(columns={'Item ID':'Purchase Count'})
most_popular_count_df.head()

         Purchase Count
Item ID
0                     4
1                     3
2                     6
3                     6
4                     5

In [643]:
most_popular_name = purchase_data_df.groupby(['Item ID'])
most_popular_name_df = pd.DataFrame(most_popular_name['Item Name'].count())
most_popular_count_df.head()

         Purchase Count
Item ID
0                     4
1                     3
2                     6
3                     6
4                     5

In [640]:
most_popular_price = purchase_data_df.groupby(['Item ID'])
most_popular_price_df = pd.DataFrame(most_popular_price['Price'].values_counts())
most_popular_price_df.head()

AttributeError: 'SeriesGroupBy' object has no attribute 'values_counts'

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame